// 3.3. Поле "Тип житла" впливає на мінімальне значення поля "Ціна за ніч":

// "Бунгало" - мінімальна ціна за ніч 0;
// "Квартира" - мінімальна ціна за ніч 1 000;
// «Будинок» - мінімальна ціна 5 000;
// "Палац" - мінімальна ціна 10 000.

// Зверніть увагу: разом із мінімальним значенням ціни потрібно змінювати і плейсхолдер.
// Зверніть увагу: обмеження мінімальної ціни полягає саме в зміні мінімального значення, 
// яке можна ввести в поле з ціною, змінювати значення поля не потрібно, це призведе до поганого UX (досвіду взаємодії). 
// Навіть якщо поточне значення не підпадає під нові обмеження, не варто без відома користувача змінювати значення поля.
const PRICE_MIN ={
    'bungalow': 0,
    'flat': 1000,
    'house': 5000,
    'palace': 10000,
}
function priseCorecting(target){
    const housingPrice = document.querySelector('#price') 

    for(const [key, value] of Object.entries(PRICE_MIN)){

        if( target === key){
            housingPrice.min = value
            housingPrice.placeholder = value
        }
    }
}


// 3.5. Поля «Час заїзду» та «Час виїзду» синхронізовані: при зміні значення одного поля у другому виділяється відповідне значення. 
// Наприклад, якщо час заїзду вказано «після 14», то час виїзду дорівнюватиме «до 14» і навпаки.

export {priseCorecting}